Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_IRQ_EN_Bits.AEIM_IM_ADDR_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEIM_IM_ADDR_IRQ_EN_OFF (5u)

/** \brief Length for Ifx_GTM_IRQ_EN_Bits.AEIM_USP_BE_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEIM_USP_BE_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_IRQ_EN_Bits.AEIM_USP_BE_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEIM_USP_BE_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_IRQ_EN_Bits.AEIM_USP_BE_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEIM_USP_BE_IRQ_EN_OFF (6u)

/** \brief Length for Ifx_GTM_IRQ_EN_Bits.CLK_EN_ERR_IRQ_EN */
#define IFX_GTM_IRQ_EN_CLK_EN_ERR_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_IRQ_EN_Bits.CLK_EN_ERR_IRQ_EN */
#define IFX_GTM_IRQ_EN_CLK_EN_ERR_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_IRQ_EN_Bits.CLK_EN_ERR_IRQ_EN */
#define IFX_GTM_IRQ_EN_CLK_EN_ERR_IRQ_EN_OFF (7u)

/** \brief Length for Ifx_GTM_IRQ_EN_Bits.CLK_PER_ERR_IRQ_EN */
#define IFX_GTM_IRQ_EN_CLK_PER_ERR_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_IRQ_EN_Bits.CLK_PER_ERR_IRQ_EN */
#define IFX_GTM_IRQ_EN_CLK_PER_ERR_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_IRQ_EN_Bits.CLK_PER_ERR_IRQ_EN */
#define IFX_GTM_IRQ_EN_CLK_PER_ERR_IRQ_EN_OFF (8u)

/** \brief Length for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEI_TO_XPT */
#define IFX_GTM_IRQ_FORCINT_TRG_AEI_TO_XPT_LEN (1u)

/** \brief Mask for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEI_TO_XPT */
#define IFX_GTM_IRQ_FORCINT_TRG_AEI_TO_XPT_MSK (0x1u)

/** \brief Offset for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEI_TO_XPT */
#define IFX_GTM_IRQ_FORCINT_TRG_AEI_TO_XPT_OFF (0u)

/** \brief Length for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEI_USP_ADDR */
#define IFX_GTM_IRQ_FORCINT_TRG_AEI_USP_ADDR_LEN (1u)

/** \brief Mask for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEI_USP_ADDR */
#define IFX_GTM_IRQ_FORCINT_TRG_AEI_USP_ADDR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEI_USP_ADDR */
#define IFX_GTM_IRQ_FORCINT_TRG_AEI_USP_ADDR_OFF (1u)

/** \brief Length for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEI_IM_ADDR */
#define IFX_GTM_IRQ_FORCINT_TRG_AEI_IM_ADDR_LEN (1u)

/** \brief Mask for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEI_IM_ADDR */
#define IFX_GTM_IRQ_FORCINT_TRG_AEI_IM_ADDR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEI_IM_ADDR */
#define IFX_GTM_IRQ_FORCINT_TRG_AEI_IM_ADDR_OFF (2u)

/** \brief Length for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEI_USP_BE */
#define IFX_GTM_IRQ_FORCINT_TRG_AEI_USP_BE_LEN (1u)

/** \brief Mask for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEI_USP_BE */
#define IFX_GTM_IRQ_FORCINT_TRG_AEI_USP_BE_MSK (0x1u)

/** \brief Offset for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEI_USP_BE */
#define IFX_GTM_IRQ_FORCINT_TRG_AEI_USP_BE_OFF (3u)

/** \brief Length for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEIM_USP_ADDR */
#define IFX_GTM_IRQ_FORCINT_TRG_AEIM_USP_ADDR_LEN (1u)

/** \brief Mask for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEIM_USP_ADDR */
#define IFX_GTM_IRQ_FORCINT_TRG_AEIM_USP_ADDR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEIM_USP_ADDR */
#define IFX_GTM_IRQ_FORCINT_TRG_AEIM_USP_ADDR_OFF (4u)

/** \brief Length for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEIM_IM_ADDR */
#define IFX_GTM_IRQ_FORCINT_TRG_AEIM_IM_ADDR_LEN (1u)

/** \brief Mask for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEIM_IM_ADDR */
#define IFX_GTM_IRQ_FORCINT_TRG_AEIM_IM_ADDR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEIM_IM_ADDR */
#define IFX_GTM_IRQ_FORCINT_TRG_AEIM_IM_ADDR_OFF (5u)

/** \brief Length for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEIM_USP_BE */
#define IFX_GTM_IRQ_FORCINT_TRG_AEIM_USP_BE_LEN (1u)

/** \brief Mask for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEIM_USP_BE */
#define IFX_GTM_IRQ_FORCINT_TRG_AEIM_USP_BE_MSK (0x1u)

/** \brief Offset for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEIM_USP_BE */
#define IFX_GTM_IRQ_FORCINT_TRG_AEIM_USP_BE_OFF (6u)

/** \brief Length for Ifx_GTM_IRQ_FORCINT_Bits.TRG_CLK_EN_ERR */
#define IFX_GTM_IRQ_FORCINT_TRG_CLK_EN_ERR_LEN (1u)

/** \brief Mask for Ifx_GTM_IRQ_FORCINT_Bits.TRG_CLK_EN_ERR */
#define IFX_GTM_IRQ_FORCINT_TRG_CLK_EN_ERR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_IRQ_FORCINT_Bits.TRG_CLK_EN_ERR */
#define IFX_GTM_IRQ_FORCINT_TRG_CLK_EN_ERR_OFF (7u)

/** \brief Length for Ifx_GTM_IRQ_FORCINT_Bits.TRG_CLK_PER_ERR */
#define IFX_GTM_IRQ_FORCINT_TRG_CLK_PER_ERR_LEN (1u)

/** \brief Mask for Ifx_GTM_IRQ_FORCINT_Bits.TRG_CLK_PER_ERR */
#define IFX_GTM_IRQ_FORCINT_TRG_CLK_PER_ERR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_IRQ_FORCINT_Bits.TRG_CLK_PER_ERR */
#define IFX_GTM_IRQ_FORCINT_TRG_CLK_PER_ERR_OFF (8u)

/** \brief Length for Ifx_GTM_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_IRQ_MODE_IRQ_MODE_LEN (2u)

/** \brief Mask for Ifx_GTM_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_IRQ_MODE_IRQ_MODE_MSK (0x3u)

/** \brief Offset for Ifx_GTM_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_IRQ_MODE_IRQ_MODE_OFF (0u)

/** \brief Length for Ifx_GTM_EIRQ_EN_Bits.AEI_TO_XPT_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_TO_XPT_EIRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_EIRQ_EN_Bits.AEI_TO_XPT_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_TO_XPT_EIRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_EIRQ_EN_Bits.AEI_TO_XPT_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_TO_XPT_EIRQ_EN_OFF (0u)

/** \brief Length for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_ADDR_EIRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_ADDR_EIRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_ADDR_EIRQ_EN_OFF (1u)

/** \brief Length for Ifx_GTM_EIRQ_EN_Bits.AEI_IM_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_IM_ADDR_EIRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_EIRQ_EN_Bits.AEI_IM_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_IM_ADDR_EIRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_EIRQ_EN_Bits.AEI_IM_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_IM_ADDR_EIRQ_EN_OFF (2u)

/** \brief Length for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_BE_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_BE_EIRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_BE_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_BE_EIRQ_EN_MSK (0x1u)

