Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_5_5 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_5_5_OFF (13u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_5_6 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_5_6_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_5_6 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_5_6_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_5_6 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_5_6_OFF (14u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_5_7 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_5_7_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_5_7 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_5_7_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_5_7 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_5_7_OFF (15u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_0 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_0_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_0 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_0 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_0_OFF (16u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_1 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_1_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_1 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_1 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_1_OFF (17u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_2 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_2_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_2 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_2 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_2_OFF (18u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_3 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_3_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_3 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_3 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_3_OFF (19u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_4 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_4_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_4 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_4 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_4_OFF (20u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_5 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_5_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_5 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_5_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_5 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_5_OFF (21u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_6 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_6_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_6 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_6_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_6 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_6_OFF (22u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_7 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_7_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_7 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_7_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_7 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_7_OFF (23u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_0 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_0_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_0 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_0 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_0_OFF (24u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_1 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_1_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_1 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_1 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_1_OFF (25u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_2 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_2_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_2 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_2 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_2_OFF (26u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_3 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_3_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_3 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_3 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_3_OFF (27u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_4 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_4_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_4 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_4 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_4_OFF (28u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_5 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_5_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_5 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_5_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_5 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_5_OFF (29u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_6 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_6_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_6 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_6_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_6 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_6_OFF (30u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_7 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_7_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_7 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_7_MSK (0x1u)

