Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_bf.h
/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_TISI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_TISI_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_TISI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_TISI_IRQ_OFF (5u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_MSI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_MSI_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_MSI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_MSI_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_MSI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_MSI_IRQ_OFF (6u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_MTI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_MTI_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_MTI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_MTI_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_MTI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_MTI_IRQ_OFF (7u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_SASI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_SASI_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_SASI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_SASI_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_SASI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_SASI_IRQ_OFF (8u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_TASI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_TASI_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_TASI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_TASI_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_TASI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_TASI_IRQ_OFF (9u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_PWI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_PWI_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_PWI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_PWI_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_PWI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_PWI_IRQ_OFF (10u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_W2I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_W2I_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_W2I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_W2I_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_W2I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_W2I_IRQ_OFF (11u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_W1I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_W1I_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_W1I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_W1I_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_W1I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_W1I_IRQ_OFF (12u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_GL1I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_GL1I_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_GL1I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_GL1I_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_GL1I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_GL1I_IRQ_OFF (13u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_LL1I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_LL1I_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_LL1I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_LL1I_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_LL1I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_LL1I_IRQ_OFF (14u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_EI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_EI_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_EI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_EI_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_EI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_EI_IRQ_OFF (15u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_GL2I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_GL2I_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_GL2I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_GL2I_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_GL2I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_GL2I_IRQ_OFF (16u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_LL2I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_LL2I_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_LL2I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_LL2I_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_LL2I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_LL2I_IRQ_OFF (17u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_TE0I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_TE0I_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_TE0I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_TE0I_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_TE0I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_TE0I_IRQ_OFF (18u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_TE1I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_TE1I_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_TE1I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_TE1I_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_TE1I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_TE1I_IRQ_OFF (19u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_TE2I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_TE2I_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_TE2I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_TE2I_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_TE2I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_TE2I_IRQ_OFF (20u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_TE3I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_TE3I_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_TE3I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_TE3I_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_TE3I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_TE3I_IRQ_OFF (21u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_TE4I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_TE4I_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_TE4I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_TE4I_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_TE4I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_TE4I_IRQ_OFF (22u)

