Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_ICM_IRQG_R2_Bits.TIM1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM1_CH5_IRQ_OFF (13u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R2_Bits.TIM1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM1_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R2_Bits.TIM1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM1_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R2_Bits.TIM1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM1_CH6_IRQ_OFF (14u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R2_Bits.TIM1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM1_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R2_Bits.TIM1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM1_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R2_Bits.TIM1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM1_CH7_IRQ_OFF (15u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R2_Bits.TIM2_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM2_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R2_Bits.TIM2_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM2_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R2_Bits.TIM2_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM2_CH0_IRQ_OFF (16u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R2_Bits.TIM2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM2_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R2_Bits.TIM2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM2_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R2_Bits.TIM2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM2_CH1_IRQ_OFF (17u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R2_Bits.TIM2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM2_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R2_Bits.TIM2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM2_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R2_Bits.TIM2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM2_CH2_IRQ_OFF (18u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R2_Bits.TIM2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM2_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R2_Bits.TIM2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM2_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R2_Bits.TIM2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM2_CH3_IRQ_OFF (19u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R2_Bits.TIM2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM2_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R2_Bits.TIM2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM2_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R2_Bits.TIM2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM2_CH4_IRQ_OFF (20u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R2_Bits.TIM2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM2_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R2_Bits.TIM2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM2_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R2_Bits.TIM2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM2_CH5_IRQ_OFF (21u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R2_Bits.TIM2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM2_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R2_Bits.TIM2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM2_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R2_Bits.TIM2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM2_CH6_IRQ_OFF (22u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R2_Bits.TIM2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM2_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R2_Bits.TIM2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM2_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R2_Bits.TIM2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM2_CH7_IRQ_OFF (23u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH0_IRQ_OFF (24u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH1_IRQ_OFF (25u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH2_IRQ_OFF (26u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH3_IRQ_OFF (27u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH4_IRQ_OFF (28u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH5_IRQ_OFF (29u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH6_IRQ_OFF (30u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH7_IRQ_LEN (1u)

