Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_ICM_IRQG_R4_Bits.MCS2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS2_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R4_Bits.MCS2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS2_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R4_Bits.MCS2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS2_CH5_IRQ_OFF (21u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R4_Bits.MCS2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS2_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R4_Bits.MCS2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS2_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R4_Bits.MCS2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS2_CH6_IRQ_OFF (22u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R4_Bits.MCS2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS2_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R4_Bits.MCS2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS2_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R4_Bits.MCS2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS2_CH7_IRQ_OFF (23u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH0_IRQ_OFF (24u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH1_IRQ_OFF (25u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH2_IRQ_OFF (26u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH3_IRQ_OFF (27u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH4_IRQ_OFF (28u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH5_IRQ_OFF (29u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH6_IRQ_OFF (30u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R4_Bits.MCS3_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS3_CH7_IRQ_OFF (31u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH0_IRQ_OFF (0u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH1_IRQ_OFF (1u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH2_IRQ_OFF (2u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH3_IRQ_OFF (3u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH4_IRQ_OFF (4u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH5_IRQ_OFF (5u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH6_IRQ_OFF (6u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R5_Bits.MCS4_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R5_MCS4_CH7_IRQ_MSK (0x1u)

