Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_bf.h
/** \brief Mask for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH0_IRQ_OFF (0u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH1_IRQ_OFF (1u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH2_IRQ_OFF (2u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH3_IRQ_OFF (3u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH4_IRQ_OFF (4u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH5_IRQ_OFF (5u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH6_IRQ_OFF (6u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH7_IRQ_OFF (7u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH8_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH8_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH8_IRQ_OFF (8u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH9_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH9_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH9_IRQ_OFF (9u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH10_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH10_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH10_IRQ_OFF (10u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH11_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH11_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH11_IRQ_OFF (11u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH12_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH12_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH12_IRQ_OFF (12u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH13_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH13_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH13_IRQ_OFF (13u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH14_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH14_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH14_IRQ_OFF (14u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH15_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH15_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R7_Bits.TOM2_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM2_CH15_IRQ_OFF (15u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R7_Bits.TOM3_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM3_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R7_Bits.TOM3_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM3_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R7_Bits.TOM3_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM3_CH0_IRQ_OFF (16u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R7_Bits.TOM3_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM3_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R7_Bits.TOM3_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM3_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R7_Bits.TOM3_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM3_CH1_IRQ_OFF (17u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R7_Bits.TOM3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM3_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R7_Bits.TOM3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM3_CH2_IRQ_MSK (0x1u)

