Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM5_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM5_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM5_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM5_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM5_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM5_CH4_IRQ_OFF (12u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM5_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM5_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM5_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM5_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM5_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM5_CH5_IRQ_OFF (13u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM5_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM5_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM5_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM5_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM5_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM5_CH6_IRQ_OFF (14u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM5_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM5_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM5_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM5_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM5_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM5_CH7_IRQ_OFF (15u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM6_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM6_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM6_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM6_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM6_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM6_CH0_IRQ_OFF (16u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM6_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM6_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM6_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM6_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM6_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM6_CH1_IRQ_OFF (17u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM6_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM6_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM6_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM6_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM6_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM6_CH2_IRQ_OFF (18u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM6_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM6_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM6_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM6_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM6_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM6_CH3_IRQ_OFF (19u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM6_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM6_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM6_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM6_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM6_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM6_CH4_IRQ_OFF (20u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM6_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM6_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM6_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM6_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM6_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM6_CH5_IRQ_OFF (21u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM6_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM6_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM6_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM6_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM6_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM6_CH6_IRQ_OFF (22u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM6_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM6_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM6_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM6_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM6_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM6_CH7_IRQ_OFF (23u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH0_IRQ_OFF (24u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH1_IRQ_OFF (25u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH2_IRQ_OFF (26u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH3_IRQ_OFF (27u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH4_IRQ_OFF (28u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH5_IRQ_OFF (29u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH6_IRQ_MSK (0x1u)

