Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_bf.h
/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.FIFO_M2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_FIFO_M2_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.FIFO_M2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_FIFO_M2_EIRQ_OFF (19u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.TIM_M3_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_TIM_M3_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.TIM_M3_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_TIM_M3_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.TIM_M3_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_TIM_M3_EIRQ_OFF (24u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.MCS_M3_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_MCS_M3_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.MCS_M3_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_MCS_M3_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.MCS_M3_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_MCS_M3_EIRQ_OFF (25u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.SPE_M3_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_SPE_M3_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.SPE_M3_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_SPE_M3_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.SPE_M3_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_SPE_M3_EIRQ_OFF (26u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH0_IRQ_OFF (0u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH1_IRQ_OFF (1u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH2_IRQ_OFF (2u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH3_IRQ_OFF (3u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH4_IRQ_OFF (4u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH5_IRQ_OFF (5u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH6_IRQ_OFF (6u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH7_IRQ_OFF (7u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M0_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M0_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M0_CH0_IRQ_OFF (0u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M0_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M0_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M0_CH1_IRQ_OFF (1u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M0_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M0_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M0_CH2_IRQ_OFF (2u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M0_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M0_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M0_CH3_IRQ_OFF (3u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M0_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M0_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M0_CH4_IRQ_OFF (4u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M0_CH5_IRQ_LEN (1u)

