Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_bf.h
/** \brief Mask for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR0_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR0_EN_MSK (0x3u)

/** \brief Offset for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR0_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR0_EN_OFF (0u)

/** \brief Length for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR1_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR1_EN_LEN (2u)

/** \brief Mask for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR1_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR1_EN_MSK (0x3u)

/** \brief Offset for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR1_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR1_EN_OFF (2u)

/** \brief Length for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR2_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR2_EN_LEN (2u)

/** \brief Mask for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR2_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR2_EN_MSK (0x3u)

/** \brief Offset for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR2_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR2_EN_OFF (4u)

/** \brief Length for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR3_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR3_EN_LEN (2u)

/** \brief Mask for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR3_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR3_EN_MSK (0x3u)

/** \brief Offset for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR3_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR3_EN_OFF (6u)

/** \brief Length for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR4_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR4_EN_LEN (2u)

/** \brief Mask for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR4_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR4_EN_MSK (0x3u)

/** \brief Offset for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR4_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR4_EN_OFF (8u)

/** \brief Length for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR5_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR5_EN_LEN (2u)

/** \brief Mask for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR5_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR5_EN_MSK (0x3u)

/** \brief Offset for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR5_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR5_EN_OFF (10u)

/** \brief Length for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR6_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR6_EN_LEN (2u)

/** \brief Mask for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR6_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR6_EN_MSK (0x3u)

/** \brief Offset for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR6_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR6_EN_OFF (12u)

/** \brief Length for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR7_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR7_EN_LEN (2u)

/** \brief Mask for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR7_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR7_EN_MSK (0x3u)

/** \brief Offset for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR7_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR7_EN_OFF (14u)

/** \brief Length for Ifx_GTM_PSM_F2A_F2A_CTRL_Bits.STR4_CONF */
#define IFX_GTM_PSM_F2A_F2A_CTRL_STR4_CONF_LEN (2u)

/** \brief Mask for Ifx_GTM_PSM_F2A_F2A_CTRL_Bits.STR4_CONF */
#define IFX_GTM_PSM_F2A_F2A_CTRL_STR4_CONF_MSK (0x3u)

/** \brief Offset for Ifx_GTM_PSM_F2A_F2A_CTRL_Bits.STR4_CONF */
#define IFX_GTM_PSM_F2A_F2A_CTRL_STR4_CONF_OFF (0u)

/** \brief Length for Ifx_GTM_PSM_F2A_F2A_CTRL_Bits.STR5_CONF */
#define IFX_GTM_PSM_F2A_F2A_CTRL_STR5_CONF_LEN (2u)

/** \brief Mask for Ifx_GTM_PSM_F2A_F2A_CTRL_Bits.STR5_CONF */
#define IFX_GTM_PSM_F2A_F2A_CTRL_STR5_CONF_MSK (0x3u)

/** \brief Offset for Ifx_GTM_PSM_F2A_F2A_CTRL_Bits.STR5_CONF */
#define IFX_GTM_PSM_F2A_F2A_CTRL_STR5_CONF_OFF (2u)

/** \brief Length for Ifx_GTM_PSM_F2A_F2A_CTRL_Bits.STR6_CONF */
#define IFX_GTM_PSM_F2A_F2A_CTRL_STR6_CONF_LEN (2u)

/** \brief Mask for Ifx_GTM_PSM_F2A_F2A_CTRL_Bits.STR6_CONF */
#define IFX_GTM_PSM_F2A_F2A_CTRL_STR6_CONF_MSK (0x3u)

/** \brief Offset for Ifx_GTM_PSM_F2A_F2A_CTRL_Bits.STR6_CONF */
#define IFX_GTM_PSM_F2A_F2A_CTRL_STR6_CONF_OFF (4u)

/** \brief Length for Ifx_GTM_PSM_F2A_F2A_CTRL_Bits.STR7_CONF */
#define IFX_GTM_PSM_F2A_F2A_CTRL_STR7_CONF_LEN (2u)

/** \brief Mask for Ifx_GTM_PSM_F2A_F2A_CTRL_Bits.STR7_CONF */
#define IFX_GTM_PSM_F2A_F2A_CTRL_STR7_CONF_MSK (0x3u)

/** \brief Offset for Ifx_GTM_PSM_F2A_F2A_CTRL_Bits.STR7_CONF */
#define IFX_GTM_PSM_F2A_F2A_CTRL_STR7_CONF_OFF (6u)

/** \brief Length for Ifx_GTM_PSM_AFD_CH_BUF_ACC_Bits.DATA */
#define IFX_GTM_PSM_AFD_CH_BUF_ACC_DATA_LEN (29u)

/** \brief Mask for Ifx_GTM_PSM_AFD_CH_BUF_ACC_Bits.DATA */
#define IFX_GTM_PSM_AFD_CH_BUF_ACC_DATA_MSK (0x1fffffffu)

/** \brief Offset for Ifx_GTM_PSM_AFD_CH_BUF_ACC_Bits.DATA */
#define IFX_GTM_PSM_AFD_CH_BUF_ACC_DATA_OFF (0u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_CTRL_Bits.RBM */
#define IFX_GTM_PSM_FIFO_CH_CTRL_RBM_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_CTRL_Bits.RBM */
#define IFX_GTM_PSM_FIFO_CH_CTRL_RBM_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_CTRL_Bits.RBM */
#define IFX_GTM_PSM_FIFO_CH_CTRL_RBM_OFF (0u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_CTRL_Bits.RAP */
#define IFX_GTM_PSM_FIFO_CH_CTRL_RAP_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_CTRL_Bits.RAP */
#define IFX_GTM_PSM_FIFO_CH_CTRL_RAP_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_CTRL_Bits.RAP */
#define IFX_GTM_PSM_FIFO_CH_CTRL_RAP_OFF (1u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_CTRL_Bits.FLUSH */
#define IFX_GTM_PSM_FIFO_CH_CTRL_FLUSH_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_CTRL_Bits.FLUSH */
#define IFX_GTM_PSM_FIFO_CH_CTRL_FLUSH_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_CTRL_Bits.FLUSH */
#define IFX_GTM_PSM_FIFO_CH_CTRL_FLUSH_OFF (2u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_CTRL_Bits.WULOCK */
#define IFX_GTM_PSM_FIFO_CH_CTRL_WULOCK_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_CTRL_Bits.WULOCK */
#define IFX_GTM_PSM_FIFO_CH_CTRL_WULOCK_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_CTRL_Bits.WULOCK */
#define IFX_GTM_PSM_FIFO_CH_CTRL_WULOCK_OFF (3u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_END_ADDR_Bits.ADDR */
#define IFX_GTM_PSM_FIFO_CH_END_ADDR_ADDR_LEN (10u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_END_ADDR_Bits.ADDR */
#define IFX_GTM_PSM_FIFO_CH_END_ADDR_ADDR_MSK (0x3ffu)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_END_ADDR_Bits.ADDR */
#define IFX_GTM_PSM_FIFO_CH_END_ADDR_ADDR_OFF (0u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_START_ADDR_Bits.ADDR */
#define IFX_GTM_PSM_FIFO_CH_START_ADDR_ADDR_LEN (10u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_START_ADDR_Bits.ADDR */
#define IFX_GTM_PSM_FIFO_CH_START_ADDR_ADDR_MSK (0x3ffu)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_START_ADDR_Bits.ADDR */
#define IFX_GTM_PSM_FIFO_CH_START_ADDR_ADDR_OFF (0u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_UPPER_WM_Bits.ADDR */
#define IFX_GTM_PSM_FIFO_CH_UPPER_WM_ADDR_LEN (10u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_UPPER_WM_Bits.ADDR */
#define IFX_GTM_PSM_FIFO_CH_UPPER_WM_ADDR_MSK (0x3ffu)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_UPPER_WM_Bits.ADDR */
#define IFX_GTM_PSM_FIFO_CH_UPPER_WM_ADDR_OFF (0u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_LOWER_WM_Bits.ADDR */
#define IFX_GTM_PSM_FIFO_CH_LOWER_WM_ADDR_LEN (10u)

