Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_bf.h
/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_LOWER_WM_Bits.ADDR */
#define IFX_GTM_PSM_FIFO_CH_LOWER_WM_ADDR_MSK (0x3ffu)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_LOWER_WM_Bits.ADDR */
#define IFX_GTM_PSM_FIFO_CH_LOWER_WM_ADDR_OFF (0u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_STATUS_Bits.EMPTY */
#define IFX_GTM_PSM_FIFO_CH_STATUS_EMPTY_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_STATUS_Bits.EMPTY */
#define IFX_GTM_PSM_FIFO_CH_STATUS_EMPTY_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_STATUS_Bits.EMPTY */
#define IFX_GTM_PSM_FIFO_CH_STATUS_EMPTY_OFF (0u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_STATUS_Bits.FULL */
#define IFX_GTM_PSM_FIFO_CH_STATUS_FULL_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_STATUS_Bits.FULL */
#define IFX_GTM_PSM_FIFO_CH_STATUS_FULL_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_STATUS_Bits.FULL */
#define IFX_GTM_PSM_FIFO_CH_STATUS_FULL_OFF (1u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_STATUS_Bits.LOW_WM */
#define IFX_GTM_PSM_FIFO_CH_STATUS_LOW_WM_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_STATUS_Bits.LOW_WM */
#define IFX_GTM_PSM_FIFO_CH_STATUS_LOW_WM_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_STATUS_Bits.LOW_WM */
#define IFX_GTM_PSM_FIFO_CH_STATUS_LOW_WM_OFF (2u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_STATUS_Bits.UP_WM */
#define IFX_GTM_PSM_FIFO_CH_STATUS_UP_WM_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_STATUS_Bits.UP_WM */
#define IFX_GTM_PSM_FIFO_CH_STATUS_UP_WM_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_STATUS_Bits.UP_WM */
#define IFX_GTM_PSM_FIFO_CH_STATUS_UP_WM_OFF (3u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_FILL_LEVEL_Bits.LEVEL */
#define IFX_GTM_PSM_FIFO_CH_FILL_LEVEL_LEVEL_LEN (11u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_FILL_LEVEL_Bits.LEVEL */
#define IFX_GTM_PSM_FIFO_CH_FILL_LEVEL_LEVEL_MSK (0x7ffu)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_FILL_LEVEL_Bits.LEVEL */
#define IFX_GTM_PSM_FIFO_CH_FILL_LEVEL_LEVEL_OFF (0u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_WR_PTR_Bits.ADDR */
#define IFX_GTM_PSM_FIFO_CH_WR_PTR_ADDR_LEN (10u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_WR_PTR_Bits.ADDR */
#define IFX_GTM_PSM_FIFO_CH_WR_PTR_ADDR_MSK (0x3ffu)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_WR_PTR_Bits.ADDR */
#define IFX_GTM_PSM_FIFO_CH_WR_PTR_ADDR_OFF (0u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_RD_PTR_Bits.ADDR */
#define IFX_GTM_PSM_FIFO_CH_RD_PTR_ADDR_LEN (10u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_RD_PTR_Bits.ADDR */
#define IFX_GTM_PSM_FIFO_CH_RD_PTR_ADDR_MSK (0x3ffu)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_RD_PTR_Bits.ADDR */
#define IFX_GTM_PSM_FIFO_CH_RD_PTR_ADDR_OFF (0u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_IRQ_NOTIFY_Bits.FIFO_EMPTY */
#define IFX_GTM_PSM_FIFO_CH_IRQ_NOTIFY_FIFO_EMPTY_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_IRQ_NOTIFY_Bits.FIFO_EMPTY */
#define IFX_GTM_PSM_FIFO_CH_IRQ_NOTIFY_FIFO_EMPTY_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_IRQ_NOTIFY_Bits.FIFO_EMPTY */
#define IFX_GTM_PSM_FIFO_CH_IRQ_NOTIFY_FIFO_EMPTY_OFF (0u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_IRQ_NOTIFY_Bits.FIFO_FULL */
#define IFX_GTM_PSM_FIFO_CH_IRQ_NOTIFY_FIFO_FULL_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_IRQ_NOTIFY_Bits.FIFO_FULL */
#define IFX_GTM_PSM_FIFO_CH_IRQ_NOTIFY_FIFO_FULL_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_IRQ_NOTIFY_Bits.FIFO_FULL */
#define IFX_GTM_PSM_FIFO_CH_IRQ_NOTIFY_FIFO_FULL_OFF (1u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_IRQ_NOTIFY_Bits.FIFO_LWM */
#define IFX_GTM_PSM_FIFO_CH_IRQ_NOTIFY_FIFO_LWM_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_IRQ_NOTIFY_Bits.FIFO_LWM */
#define IFX_GTM_PSM_FIFO_CH_IRQ_NOTIFY_FIFO_LWM_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_IRQ_NOTIFY_Bits.FIFO_LWM */
#define IFX_GTM_PSM_FIFO_CH_IRQ_NOTIFY_FIFO_LWM_OFF (2u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_IRQ_NOTIFY_Bits.FIFO_UWM */
#define IFX_GTM_PSM_FIFO_CH_IRQ_NOTIFY_FIFO_UWM_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_IRQ_NOTIFY_Bits.FIFO_UWM */
#define IFX_GTM_PSM_FIFO_CH_IRQ_NOTIFY_FIFO_UWM_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_IRQ_NOTIFY_Bits.FIFO_UWM */
#define IFX_GTM_PSM_FIFO_CH_IRQ_NOTIFY_FIFO_UWM_OFF (3u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_IRQ_EN_Bits.FIFO_EMPTY_IRQ_EN */
#define IFX_GTM_PSM_FIFO_CH_IRQ_EN_FIFO_EMPTY_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_IRQ_EN_Bits.FIFO_EMPTY_IRQ_EN */
#define IFX_GTM_PSM_FIFO_CH_IRQ_EN_FIFO_EMPTY_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_IRQ_EN_Bits.FIFO_EMPTY_IRQ_EN */
#define IFX_GTM_PSM_FIFO_CH_IRQ_EN_FIFO_EMPTY_IRQ_EN_OFF (0u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_IRQ_EN_Bits.FIFO_FULL_IRQ_EN */
#define IFX_GTM_PSM_FIFO_CH_IRQ_EN_FIFO_FULL_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_IRQ_EN_Bits.FIFO_FULL_IRQ_EN */
#define IFX_GTM_PSM_FIFO_CH_IRQ_EN_FIFO_FULL_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_IRQ_EN_Bits.FIFO_FULL_IRQ_EN */
#define IFX_GTM_PSM_FIFO_CH_IRQ_EN_FIFO_FULL_IRQ_EN_OFF (1u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_IRQ_EN_Bits.FIFO_LWM_IRQ_EN */
#define IFX_GTM_PSM_FIFO_CH_IRQ_EN_FIFO_LWM_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_IRQ_EN_Bits.FIFO_LWM_IRQ_EN */
#define IFX_GTM_PSM_FIFO_CH_IRQ_EN_FIFO_LWM_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_IRQ_EN_Bits.FIFO_LWM_IRQ_EN */
#define IFX_GTM_PSM_FIFO_CH_IRQ_EN_FIFO_LWM_IRQ_EN_OFF (2u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_IRQ_EN_Bits.FIFO_UWM_IRQ_EN */
#define IFX_GTM_PSM_FIFO_CH_IRQ_EN_FIFO_UWM_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_IRQ_EN_Bits.FIFO_UWM_IRQ_EN */
#define IFX_GTM_PSM_FIFO_CH_IRQ_EN_FIFO_UWM_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_IRQ_EN_Bits.FIFO_UWM_IRQ_EN */
#define IFX_GTM_PSM_FIFO_CH_IRQ_EN_FIFO_UWM_IRQ_EN_OFF (3u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_EMPTY */
#define IFX_GTM_PSM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_EMPTY_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_EMPTY */
#define IFX_GTM_PSM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_EMPTY_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_EMPTY */
#define IFX_GTM_PSM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_EMPTY_OFF (0u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_FULL */
#define IFX_GTM_PSM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_FULL_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_FULL */
#define IFX_GTM_PSM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_FULL_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_IRQ_FORCINT_Bits.TRG_FIFO_FULL */
#define IFX_GTM_PSM_FIFO_CH_IRQ_FORCINT_TRG_FIFO_FULL_OFF (1u)

