Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_bf.h
/** \brief Mask for Ifx_GTM_DPLL_CTRL_0_Bits.SEN */
#define IFX_GTM_DPLL_CTRL_0_SEN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_0_Bits.SEN */
#define IFX_GTM_DPLL_CTRL_0_SEN_OFF (29u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_0_Bits.TEN */
#define IFX_GTM_DPLL_CTRL_0_TEN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_0_Bits.TEN */
#define IFX_GTM_DPLL_CTRL_0_TEN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_0_Bits.TEN */
#define IFX_GTM_DPLL_CTRL_0_TEN_OFF (30u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_0_Bits.RMO */
#define IFX_GTM_DPLL_CTRL_0_RMO_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_0_Bits.RMO */
#define IFX_GTM_DPLL_CTRL_0_RMO_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_0_Bits.RMO */
#define IFX_GTM_DPLL_CTRL_0_RMO_OFF (31u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_Bits.DMO */
#define IFX_GTM_DPLL_CTRL_1_DMO_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_Bits.DMO */
#define IFX_GTM_DPLL_CTRL_1_DMO_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_Bits.DMO */
#define IFX_GTM_DPLL_CTRL_1_DMO_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_Bits.DEN */
#define IFX_GTM_DPLL_CTRL_1_DEN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_Bits.DEN */
#define IFX_GTM_DPLL_CTRL_1_DEN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_Bits.DEN */
#define IFX_GTM_DPLL_CTRL_1_DEN_OFF (1u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_Bits.IDDS */
#define IFX_GTM_DPLL_CTRL_1_IDDS_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_Bits.IDDS */
#define IFX_GTM_DPLL_CTRL_1_IDDS_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_Bits.IDDS */
#define IFX_GTM_DPLL_CTRL_1_IDDS_OFF (2u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_Bits.COA */
#define IFX_GTM_DPLL_CTRL_1_COA_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_Bits.COA */
#define IFX_GTM_DPLL_CTRL_1_COA_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_Bits.COA */
#define IFX_GTM_DPLL_CTRL_1_COA_OFF (3u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_Bits.PIT */
#define IFX_GTM_DPLL_CTRL_1_PIT_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_Bits.PIT */
#define IFX_GTM_DPLL_CTRL_1_PIT_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_Bits.PIT */
#define IFX_GTM_DPLL_CTRL_1_PIT_OFF (4u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_Bits.SGE1 */
#define IFX_GTM_DPLL_CTRL_1_SGE1_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_Bits.SGE1 */
#define IFX_GTM_DPLL_CTRL_1_SGE1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_Bits.SGE1 */
#define IFX_GTM_DPLL_CTRL_1_SGE1_OFF (5u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_Bits.DLM1 */
#define IFX_GTM_DPLL_CTRL_1_DLM1_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_Bits.DLM1 */
#define IFX_GTM_DPLL_CTRL_1_DLM1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_Bits.DLM1 */
#define IFX_GTM_DPLL_CTRL_1_DLM1_OFF (6u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_Bits.PCM1 */
#define IFX_GTM_DPLL_CTRL_1_PCM1_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_Bits.PCM1 */
#define IFX_GTM_DPLL_CTRL_1_PCM1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_Bits.PCM1 */
#define IFX_GTM_DPLL_CTRL_1_PCM1_OFF (7u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_Bits.SGE2 */
#define IFX_GTM_DPLL_CTRL_1_SGE2_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_Bits.SGE2 */
#define IFX_GTM_DPLL_CTRL_1_SGE2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_Bits.SGE2 */
#define IFX_GTM_DPLL_CTRL_1_SGE2_OFF (8u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_Bits.DLM2 */
#define IFX_GTM_DPLL_CTRL_1_DLM2_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_Bits.DLM2 */
#define IFX_GTM_DPLL_CTRL_1_DLM2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_Bits.DLM2 */
#define IFX_GTM_DPLL_CTRL_1_DLM2_OFF (9u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_Bits.PCM2 */
#define IFX_GTM_DPLL_CTRL_1_PCM2_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_Bits.PCM2 */
#define IFX_GTM_DPLL_CTRL_1_PCM2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_Bits.PCM2 */
#define IFX_GTM_DPLL_CTRL_1_PCM2_OFF (10u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_Bits.SYN_NS */
#define IFX_GTM_DPLL_CTRL_1_SYN_NS_LEN (5u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_Bits.SYN_NS */
#define IFX_GTM_DPLL_CTRL_1_SYN_NS_MSK (0x1fu)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_Bits.SYN_NS */
#define IFX_GTM_DPLL_CTRL_1_SYN_NS_OFF (11u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_Bits.SYN_NT */
#define IFX_GTM_DPLL_CTRL_1_SYN_NT_LEN (6u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_Bits.SYN_NT */
#define IFX_GTM_DPLL_CTRL_1_SYN_NT_MSK (0x3fu)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_Bits.SYN_NT */
#define IFX_GTM_DPLL_CTRL_1_SYN_NT_OFF (16u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_Bits.LCD */
#define IFX_GTM_DPLL_CTRL_1_LCD_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_Bits.LCD */
#define IFX_GTM_DPLL_CTRL_1_LCD_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_Bits.LCD */
#define IFX_GTM_DPLL_CTRL_1_LCD_OFF (22u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_Bits.SWR */
#define IFX_GTM_DPLL_CTRL_1_SWR_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_Bits.SWR */
#define IFX_GTM_DPLL_CTRL_1_SWR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_Bits.SWR */
#define IFX_GTM_DPLL_CTRL_1_SWR_OFF (23u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_Bits.SYSF */
#define IFX_GTM_DPLL_CTRL_1_SYSF_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_Bits.SYSF */
#define IFX_GTM_DPLL_CTRL_1_SYSF_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_Bits.SYSF */
#define IFX_GTM_DPLL_CTRL_1_SYSF_OFF (24u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_Bits.TS0_HRS */
#define IFX_GTM_DPLL_CTRL_1_TS0_HRS_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_Bits.TS0_HRS */
#define IFX_GTM_DPLL_CTRL_1_TS0_HRS_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_Bits.TS0_HRS */
#define IFX_GTM_DPLL_CTRL_1_TS0_HRS_OFF (25u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_Bits.TS0_HRT */
#define IFX_GTM_DPLL_CTRL_1_TS0_HRT_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_Bits.TS0_HRT */
#define IFX_GTM_DPLL_CTRL_1_TS0_HRT_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_Bits.TS0_HRT */
#define IFX_GTM_DPLL_CTRL_1_TS0_HRT_OFF (26u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_Bits.SMC */
#define IFX_GTM_DPLL_CTRL_1_SMC_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_Bits.SMC */
#define IFX_GTM_DPLL_CTRL_1_SMC_MSK (0x1u)

