Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TASI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TASI_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TASI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TASI_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TASI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TASI_OFF (9u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.PWI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_PWI_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.PWI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_PWI_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.PWI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_PWI_OFF (10u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.W2I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_W2I_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.W2I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_W2I_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.W2I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_W2I_OFF (11u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.W1I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_W1I_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.W1I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_W1I_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.W1I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_W1I_OFF (12u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.GL1I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_GL1I_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.GL1I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_GL1I_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.GL1I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_GL1I_OFF (13u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.LL1I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_LL1I_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.LL1I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_LL1I_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.LL1I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_LL1I_OFF (14u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.EI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_EI_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.EI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_EI_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.EI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_EI_OFF (15u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.GL2I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_GL2I_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.GL2I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_GL2I_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.GL2I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_GL2I_OFF (16u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.LL2I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_LL2I_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.LL2I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_LL2I_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.LL2I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_LL2I_OFF (17u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TE0I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TE0I_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TE0I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TE0I_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TE0I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TE0I_OFF (18u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TE1I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TE1I_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TE1I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TE1I_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TE1I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TE1I_OFF (19u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TE2I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TE2I_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TE2I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TE2I_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TE2I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TE2I_OFF (20u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TE3I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TE3I_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TE3I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TE3I_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TE3I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TE3I_OFF (21u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TE4I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TE4I_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TE4I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TE4I_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TE4I */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TE4I_OFF (22u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.CDTI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_CDTI_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.CDTI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_CDTI_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.CDTI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_CDTI_OFF (23u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.CDSI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_CDSI_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.CDSI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_CDSI_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.CDSI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_CDSI_OFF (24u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TORI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TORI_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TORI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TORI_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.TORI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_TORI_OFF (25u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.SORI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_SORI_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.SORI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_SORI_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.SORI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_SORI_OFF (26u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.DCGI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_DCGI_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.DCGI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_DCGI_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_NOTIFY_Bits.DCGI */
#define IFX_GTM_DPLL_IRQ_NOTIFY_DCGI_OFF (27u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_EN_Bits.PDI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_PDI_IRQ_EN_LEN (1u)

