Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_bf.h
/** \brief Mask for Ifx_GTM_DPLL_ACB_Bits.ACB_0 */
#define IFX_GTM_DPLL_ACB_ACB_0_MSK (0x1fu)

/** \brief Offset for Ifx_GTM_DPLL_ACB_Bits.ACB_0 */
#define IFX_GTM_DPLL_ACB_ACB_0_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_ACB_Bits.ACB_1 */
#define IFX_GTM_DPLL_ACB_ACB_1_LEN (5u)

/** \brief Mask for Ifx_GTM_DPLL_ACB_Bits.ACB_1 */
#define IFX_GTM_DPLL_ACB_ACB_1_MSK (0x1fu)

/** \brief Offset for Ifx_GTM_DPLL_ACB_Bits.ACB_1 */
#define IFX_GTM_DPLL_ACB_ACB_1_OFF (8u)

/** \brief Length for Ifx_GTM_DPLL_ACB_Bits.ACB_2 */
#define IFX_GTM_DPLL_ACB_ACB_2_LEN (5u)

/** \brief Mask for Ifx_GTM_DPLL_ACB_Bits.ACB_2 */
#define IFX_GTM_DPLL_ACB_ACB_2_MSK (0x1fu)

/** \brief Offset for Ifx_GTM_DPLL_ACB_Bits.ACB_2 */
#define IFX_GTM_DPLL_ACB_ACB_2_OFF (16u)

/** \brief Length for Ifx_GTM_DPLL_ACB_Bits.ACB_3 */
#define IFX_GTM_DPLL_ACB_ACB_3_LEN (5u)

/** \brief Mask for Ifx_GTM_DPLL_ACB_Bits.ACB_3 */
#define IFX_GTM_DPLL_ACB_ACB_3_MSK (0x1fu)

/** \brief Offset for Ifx_GTM_DPLL_ACB_Bits.ACB_3 */
#define IFX_GTM_DPLL_ACB_ACB_3_OFF (24u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_11_Bits.SIP1 */
#define IFX_GTM_DPLL_CTRL_11_SIP1_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_11_Bits.SIP1 */
#define IFX_GTM_DPLL_CTRL_11_SIP1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_11_Bits.SIP1 */
#define IFX_GTM_DPLL_CTRL_11_SIP1_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_11_Bits.ERZ1 */
#define IFX_GTM_DPLL_CTRL_11_ERZ1_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_11_Bits.ERZ1 */
#define IFX_GTM_DPLL_CTRL_11_ERZ1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_11_Bits.ERZ1 */
#define IFX_GTM_DPLL_CTRL_11_ERZ1_OFF (1u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_11_Bits.PCMF1 */
#define IFX_GTM_DPLL_CTRL_11_PCMF1_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_11_Bits.PCMF1 */
#define IFX_GTM_DPLL_CTRL_11_PCMF1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_11_Bits.PCMF1 */
#define IFX_GTM_DPLL_CTRL_11_PCMF1_OFF (2u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_11_Bits.FSYL1 */
#define IFX_GTM_DPLL_CTRL_11_FSYL1_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_11_Bits.FSYL1 */
#define IFX_GTM_DPLL_CTRL_11_FSYL1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_11_Bits.FSYL1 */
#define IFX_GTM_DPLL_CTRL_11_FSYL1_OFF (3u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_11_Bits.INCF1 */
#define IFX_GTM_DPLL_CTRL_11_INCF1_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_11_Bits.INCF1 */
#define IFX_GTM_DPLL_CTRL_11_INCF1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_11_Bits.INCF1 */
#define IFX_GTM_DPLL_CTRL_11_INCF1_OFF (4u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_11_Bits.PCMF1_INCCNT_B */
#define IFX_GTM_DPLL_CTRL_11_PCMF1_INCCNT_B_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_11_Bits.PCMF1_INCCNT_B */
#define IFX_GTM_DPLL_CTRL_11_PCMF1_INCCNT_B_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_11_Bits.PCMF1_INCCNT_B */
#define IFX_GTM_DPLL_CTRL_11_PCMF1_INCCNT_B_OFF (5u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_11_Bits.ADT */
#define IFX_GTM_DPLL_CTRL_11_ADT_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_11_Bits.ADT */
#define IFX_GTM_DPLL_CTRL_11_ADT_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_11_Bits.ADT */
#define IFX_GTM_DPLL_CTRL_11_ADT_OFF (6u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_11_Bits.ADS */
#define IFX_GTM_DPLL_CTRL_11_ADS_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_11_Bits.ADS */
#define IFX_GTM_DPLL_CTRL_11_ADS_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_11_Bits.ADS */
#define IFX_GTM_DPLL_CTRL_11_ADS_OFF (7u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_11_Bits.SIP2 */
#define IFX_GTM_DPLL_CTRL_11_SIP2_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_11_Bits.SIP2 */
#define IFX_GTM_DPLL_CTRL_11_SIP2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_11_Bits.SIP2 */
#define IFX_GTM_DPLL_CTRL_11_SIP2_OFF (8u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_11_Bits.ERZ2 */
#define IFX_GTM_DPLL_CTRL_11_ERZ2_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_11_Bits.ERZ2 */
#define IFX_GTM_DPLL_CTRL_11_ERZ2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_11_Bits.ERZ2 */
#define IFX_GTM_DPLL_CTRL_11_ERZ2_OFF (9u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_11_Bits.PCMF2 */
#define IFX_GTM_DPLL_CTRL_11_PCMF2_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_11_Bits.PCMF2 */
#define IFX_GTM_DPLL_CTRL_11_PCMF2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_11_Bits.PCMF2 */
#define IFX_GTM_DPLL_CTRL_11_PCMF2_OFF (10u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_11_Bits.FSYL2 */
#define IFX_GTM_DPLL_CTRL_11_FSYL2_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_11_Bits.FSYL2 */
#define IFX_GTM_DPLL_CTRL_11_FSYL2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_11_Bits.FSYL2 */
#define IFX_GTM_DPLL_CTRL_11_FSYL2_OFF (11u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_11_Bits.INCF2 */
#define IFX_GTM_DPLL_CTRL_11_INCF2_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_11_Bits.INCF2 */
#define IFX_GTM_DPLL_CTRL_11_INCF2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_11_Bits.INCF2 */
#define IFX_GTM_DPLL_CTRL_11_INCF2_OFF (12u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_11_Bits.PCMF2_INCCNT_B */
#define IFX_GTM_DPLL_CTRL_11_PCMF2_INCCNT_B_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_11_Bits.PCMF2_INCCNT_B */
#define IFX_GTM_DPLL_CTRL_11_PCMF2_INCCNT_B_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_11_Bits.PCMF2_INCCNT_B */
#define IFX_GTM_DPLL_CTRL_11_PCMF2_INCCNT_B_OFF (13u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_11_Bits.STATE_EXT */
#define IFX_GTM_DPLL_CTRL_11_STATE_EXT_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_11_Bits.STATE_EXT */
#define IFX_GTM_DPLL_CTRL_11_STATE_EXT_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_11_Bits.STATE_EXT */
#define IFX_GTM_DPLL_CTRL_11_STATE_EXT_OFF (14u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_11_Bits.ACBU */
#define IFX_GTM_DPLL_CTRL_11_ACBU_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_11_Bits.ACBU */
#define IFX_GTM_DPLL_CTRL_11_ACBU_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_11_Bits.ACBU */
#define IFX_GTM_DPLL_CTRL_11_ACBU_OFF (15u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_11_Bits.WSIP1 */
#define IFX_GTM_DPLL_CTRL_11_WSIP1_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_11_Bits.WSIP1 */
#define IFX_GTM_DPLL_CTRL_11_WSIP1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_11_Bits.WSIP1 */
#define IFX_GTM_DPLL_CTRL_11_WSIP1_OFF (16u)

