Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_ADCTRIG_OUT0_Bits.SEL6 */
#define IFX_GTM_ADCTRIG_OUT0_SEL6_LEN (4u)

/** \brief Mask for Ifx_GTM_ADCTRIG_OUT0_Bits.SEL6 */
#define IFX_GTM_ADCTRIG_OUT0_SEL6_MSK (0xfu)

/** \brief Offset for Ifx_GTM_ADCTRIG_OUT0_Bits.SEL6 */
#define IFX_GTM_ADCTRIG_OUT0_SEL6_OFF (24u)

/** \brief Length for Ifx_GTM_ADCTRIG_OUT0_Bits.SEL7 */
#define IFX_GTM_ADCTRIG_OUT0_SEL7_LEN (4u)

/** \brief Mask for Ifx_GTM_ADCTRIG_OUT0_Bits.SEL7 */
#define IFX_GTM_ADCTRIG_OUT0_SEL7_MSK (0xfu)

/** \brief Offset for Ifx_GTM_ADCTRIG_OUT0_Bits.SEL7 */
#define IFX_GTM_ADCTRIG_OUT0_SEL7_OFF (28u)

/** \brief Length for Ifx_GTM_ADCTRIG_OUT1_Bits.SEL0 */
#define IFX_GTM_ADCTRIG_OUT1_SEL0_LEN (4u)

/** \brief Mask for Ifx_GTM_ADCTRIG_OUT1_Bits.SEL0 */
#define IFX_GTM_ADCTRIG_OUT1_SEL0_MSK (0xfu)

/** \brief Offset for Ifx_GTM_ADCTRIG_OUT1_Bits.SEL0 */
#define IFX_GTM_ADCTRIG_OUT1_SEL0_OFF (0u)

/** \brief Length for Ifx_GTM_ADCTRIG_OUT1_Bits.SEL1 */
#define IFX_GTM_ADCTRIG_OUT1_SEL1_LEN (4u)

/** \brief Mask for Ifx_GTM_ADCTRIG_OUT1_Bits.SEL1 */
#define IFX_GTM_ADCTRIG_OUT1_SEL1_MSK (0xfu)

/** \brief Offset for Ifx_GTM_ADCTRIG_OUT1_Bits.SEL1 */
#define IFX_GTM_ADCTRIG_OUT1_SEL1_OFF (4u)

/** \brief Length for Ifx_GTM_ADCTRIG_OUT1_Bits.SEL2 */
#define IFX_GTM_ADCTRIG_OUT1_SEL2_LEN (4u)

/** \brief Mask for Ifx_GTM_ADCTRIG_OUT1_Bits.SEL2 */
#define IFX_GTM_ADCTRIG_OUT1_SEL2_MSK (0xfu)

/** \brief Offset for Ifx_GTM_ADCTRIG_OUT1_Bits.SEL2 */
#define IFX_GTM_ADCTRIG_OUT1_SEL2_OFF (8u)

/** \brief Length for Ifx_GTM_ADCTRIG_OUT1_Bits.SEL3 */
#define IFX_GTM_ADCTRIG_OUT1_SEL3_LEN (4u)

/** \brief Mask for Ifx_GTM_ADCTRIG_OUT1_Bits.SEL3 */
#define IFX_GTM_ADCTRIG_OUT1_SEL3_MSK (0xfu)

/** \brief Offset for Ifx_GTM_ADCTRIG_OUT1_Bits.SEL3 */
#define IFX_GTM_ADCTRIG_OUT1_SEL3_OFF (12u)

/** \brief Length for Ifx_GTM_DXOUTCON_Bits.OUT0 */
#define IFX_GTM_DXOUTCON_OUT0_LEN (1u)

/** \brief Mask for Ifx_GTM_DXOUTCON_Bits.OUT0 */
#define IFX_GTM_DXOUTCON_OUT0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXOUTCON_Bits.OUT0 */
#define IFX_GTM_DXOUTCON_OUT0_OFF (0u)

/** \brief Length for Ifx_GTM_DXOUTCON_Bits.OUT1 */
#define IFX_GTM_DXOUTCON_OUT1_LEN (1u)

/** \brief Mask for Ifx_GTM_DXOUTCON_Bits.OUT1 */
#define IFX_GTM_DXOUTCON_OUT1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXOUTCON_Bits.OUT1 */
#define IFX_GTM_DXOUTCON_OUT1_OFF (1u)

/** \brief Length for Ifx_GTM_DXOUTCON_Bits.OUT2 */
#define IFX_GTM_DXOUTCON_OUT2_LEN (1u)

/** \brief Mask for Ifx_GTM_DXOUTCON_Bits.OUT2 */
#define IFX_GTM_DXOUTCON_OUT2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXOUTCON_Bits.OUT2 */
#define IFX_GTM_DXOUTCON_OUT2_OFF (2u)

/** \brief Length for Ifx_GTM_DXOUTCON_Bits.OUT3 */
#define IFX_GTM_DXOUTCON_OUT3_LEN (1u)

/** \brief Mask for Ifx_GTM_DXOUTCON_Bits.OUT3 */
#define IFX_GTM_DXOUTCON_OUT3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXOUTCON_Bits.OUT3 */
#define IFX_GTM_DXOUTCON_OUT3_OFF (3u)

/** \brief Length for Ifx_GTM_DXOUTCON_Bits.OUT4 */
#define IFX_GTM_DXOUTCON_OUT4_LEN (1u)

/** \brief Mask for Ifx_GTM_DXOUTCON_Bits.OUT4 */
#define IFX_GTM_DXOUTCON_OUT4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXOUTCON_Bits.OUT4 */
#define IFX_GTM_DXOUTCON_OUT4_OFF (4u)

/** \brief Length for Ifx_GTM_DXOUTCON_Bits.OUT5 */
#define IFX_GTM_DXOUTCON_OUT5_LEN (1u)

/** \brief Mask for Ifx_GTM_DXOUTCON_Bits.OUT5 */
#define IFX_GTM_DXOUTCON_OUT5_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXOUTCON_Bits.OUT5 */
#define IFX_GTM_DXOUTCON_OUT5_OFF (5u)

/** \brief Length for Ifx_GTM_DXOUTCON_Bits.OUT6 */
#define IFX_GTM_DXOUTCON_OUT6_LEN (1u)

/** \brief Mask for Ifx_GTM_DXOUTCON_Bits.OUT6 */
#define IFX_GTM_DXOUTCON_OUT6_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXOUTCON_Bits.OUT6 */
#define IFX_GTM_DXOUTCON_OUT6_OFF (6u)

/** \brief Length for Ifx_GTM_DXOUTCON_Bits.OUT7 */
#define IFX_GTM_DXOUTCON_OUT7_LEN (1u)

/** \brief Mask for Ifx_GTM_DXOUTCON_Bits.OUT7 */
#define IFX_GTM_DXOUTCON_OUT7_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXOUTCON_Bits.OUT7 */
#define IFX_GTM_DXOUTCON_OUT7_OFF (7u)

/** \brief Length for Ifx_GTM_DXOUTCON_Bits.OUT8 */
#define IFX_GTM_DXOUTCON_OUT8_LEN (1u)

/** \brief Mask for Ifx_GTM_DXOUTCON_Bits.OUT8 */
#define IFX_GTM_DXOUTCON_OUT8_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXOUTCON_Bits.OUT8 */
#define IFX_GTM_DXOUTCON_OUT8_OFF (8u)

/** \brief Length for Ifx_GTM_DXOUTCON_Bits.OUT9 */
#define IFX_GTM_DXOUTCON_OUT9_LEN (1u)

/** \brief Mask for Ifx_GTM_DXOUTCON_Bits.OUT9 */
#define IFX_GTM_DXOUTCON_OUT9_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXOUTCON_Bits.OUT9 */
#define IFX_GTM_DXOUTCON_OUT9_OFF (9u)

/** \brief Length for Ifx_GTM_TRIGOUT_Bits.TRIG0 */
#define IFX_GTM_TRIGOUT_TRIG0_LEN (2u)

/** \brief Mask for Ifx_GTM_TRIGOUT_Bits.TRIG0 */
#define IFX_GTM_TRIGOUT_TRIG0_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TRIGOUT_Bits.TRIG0 */
#define IFX_GTM_TRIGOUT_TRIG0_OFF (0u)

/** \brief Length for Ifx_GTM_TRIGOUT_Bits.TRIG1 */
#define IFX_GTM_TRIGOUT_TRIG1_LEN (2u)

/** \brief Mask for Ifx_GTM_TRIGOUT_Bits.TRIG1 */
#define IFX_GTM_TRIGOUT_TRIG1_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TRIGOUT_Bits.TRIG1 */
#define IFX_GTM_TRIGOUT_TRIG1_OFF (2u)

/** \brief Length for Ifx_GTM_TRIGOUT_Bits.TRIG2 */
#define IFX_GTM_TRIGOUT_TRIG2_LEN (2u)

/** \brief Mask for Ifx_GTM_TRIGOUT_Bits.TRIG2 */
#define IFX_GTM_TRIGOUT_TRIG2_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TRIGOUT_Bits.TRIG2 */
#define IFX_GTM_TRIGOUT_TRIG2_OFF (4u)

/** \brief Length for Ifx_GTM_TRIGOUT_Bits.TRIG3 */
#define IFX_GTM_TRIGOUT_TRIG3_LEN (2u)

/** \brief Mask for Ifx_GTM_TRIGOUT_Bits.TRIG3 */
#define IFX_GTM_TRIGOUT_TRIG3_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TRIGOUT_Bits.TRIG3 */
#define IFX_GTM_TRIGOUT_TRIG3_OFF (6u)

/** \brief Length for Ifx_GTM_TRIGOUT_Bits.TRIG4 */
#define IFX_GTM_TRIGOUT_TRIG4_LEN (2u)

/** \brief Mask for Ifx_GTM_TRIGOUT_Bits.TRIG4 */
#define IFX_GTM_TRIGOUT_TRIG4_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TRIGOUT_Bits.TRIG4 */
#define IFX_GTM_TRIGOUT_TRIG4_OFF (8u)

/** \brief Length for Ifx_GTM_TRIGOUT_Bits.TRIG5 */
#define IFX_GTM_TRIGOUT_TRIG5_LEN (2u)

/** \brief Mask for Ifx_GTM_TRIGOUT_Bits.TRIG5 */
#define IFX_GTM_TRIGOUT_TRIG5_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TRIGOUT_Bits.TRIG5 */
#define IFX_GTM_TRIGOUT_TRIG5_OFF (10u)

/** \brief Length for Ifx_GTM_TRIGOUT_Bits.TRIG6 */
#define IFX_GTM_TRIGOUT_TRIG6_LEN (2u)

