Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_DTMAUXINSEL_Bits.ASEL1 */
#define IFX_GTM_DTMAUXINSEL_ASEL1_LEN (2u)

/** \brief Mask for Ifx_GTM_DTMAUXINSEL_Bits.ASEL1 */
#define IFX_GTM_DTMAUXINSEL_ASEL1_MSK (0x3u)

/** \brief Offset for Ifx_GTM_DTMAUXINSEL_Bits.ASEL1 */
#define IFX_GTM_DTMAUXINSEL_ASEL1_OFF (2u)

/** \brief Length for Ifx_GTM_DTMAUXINSEL_Bits.ASEL2 */
#define IFX_GTM_DTMAUXINSEL_ASEL2_LEN (2u)

/** \brief Mask for Ifx_GTM_DTMAUXINSEL_Bits.ASEL2 */
#define IFX_GTM_DTMAUXINSEL_ASEL2_MSK (0x3u)

/** \brief Offset for Ifx_GTM_DTMAUXINSEL_Bits.ASEL2 */
#define IFX_GTM_DTMAUXINSEL_ASEL2_OFF (4u)

/** \brief Length for Ifx_GTM_DTMAUXINSEL_Bits.ASEL3 */
#define IFX_GTM_DTMAUXINSEL_ASEL3_LEN (2u)

/** \brief Mask for Ifx_GTM_DTMAUXINSEL_Bits.ASEL3 */
#define IFX_GTM_DTMAUXINSEL_ASEL3_MSK (0x3u)

/** \brief Offset for Ifx_GTM_DTMAUXINSEL_Bits.ASEL3 */
#define IFX_GTM_DTMAUXINSEL_ASEL3_OFF (6u)

/** \brief Length for Ifx_GTM_DTMAUXINSEL_Bits.ASEL4 */
#define IFX_GTM_DTMAUXINSEL_ASEL4_LEN (2u)

/** \brief Mask for Ifx_GTM_DTMAUXINSEL_Bits.ASEL4 */
#define IFX_GTM_DTMAUXINSEL_ASEL4_MSK (0x3u)

/** \brief Offset for Ifx_GTM_DTMAUXINSEL_Bits.ASEL4 */
#define IFX_GTM_DTMAUXINSEL_ASEL4_OFF (8u)

/** \brief Length for Ifx_GTM_DTMAUXINSEL_Bits.ASEL5 */
#define IFX_GTM_DTMAUXINSEL_ASEL5_LEN (2u)

/** \brief Mask for Ifx_GTM_DTMAUXINSEL_Bits.ASEL5 */
#define IFX_GTM_DTMAUXINSEL_ASEL5_MSK (0x3u)

/** \brief Offset for Ifx_GTM_DTMAUXINSEL_Bits.ASEL5 */
#define IFX_GTM_DTMAUXINSEL_ASEL5_OFF (10u)

/** \brief Length for Ifx_GTM_DTMAUXINSEL_Bits.ASEL6 */
#define IFX_GTM_DTMAUXINSEL_ASEL6_LEN (2u)

/** \brief Mask for Ifx_GTM_DTMAUXINSEL_Bits.ASEL6 */
#define IFX_GTM_DTMAUXINSEL_ASEL6_MSK (0x3u)

/** \brief Offset for Ifx_GTM_DTMAUXINSEL_Bits.ASEL6 */
#define IFX_GTM_DTMAUXINSEL_ASEL6_OFF (12u)

/** \brief Length for Ifx_GTM_DTMAUXINSEL_Bits.TSEL0 */
#define IFX_GTM_DTMAUXINSEL_TSEL0_LEN (2u)

/** \brief Mask for Ifx_GTM_DTMAUXINSEL_Bits.TSEL0 */
#define IFX_GTM_DTMAUXINSEL_TSEL0_MSK (0x3u)

/** \brief Offset for Ifx_GTM_DTMAUXINSEL_Bits.TSEL0 */
#define IFX_GTM_DTMAUXINSEL_TSEL0_OFF (16u)

/** \brief Length for Ifx_GTM_DTMAUXINSEL_Bits.TSEL1 */
#define IFX_GTM_DTMAUXINSEL_TSEL1_LEN (2u)

/** \brief Mask for Ifx_GTM_DTMAUXINSEL_Bits.TSEL1 */
#define IFX_GTM_DTMAUXINSEL_TSEL1_MSK (0x3u)

/** \brief Offset for Ifx_GTM_DTMAUXINSEL_Bits.TSEL1 */
#define IFX_GTM_DTMAUXINSEL_TSEL1_OFF (18u)

/** \brief Length for Ifx_GTM_DTMAUXINSEL_Bits.TSEL2 */
#define IFX_GTM_DTMAUXINSEL_TSEL2_LEN (2u)

/** \brief Mask for Ifx_GTM_DTMAUXINSEL_Bits.TSEL2 */
#define IFX_GTM_DTMAUXINSEL_TSEL2_MSK (0x3u)

/** \brief Offset for Ifx_GTM_DTMAUXINSEL_Bits.TSEL2 */
#define IFX_GTM_DTMAUXINSEL_TSEL2_OFF (20u)

/** \brief Length for Ifx_GTM_DTMAUXINSEL_Bits.TSEL3 */
#define IFX_GTM_DTMAUXINSEL_TSEL3_LEN (2u)

/** \brief Mask for Ifx_GTM_DTMAUXINSEL_Bits.TSEL3 */
#define IFX_GTM_DTMAUXINSEL_TSEL3_MSK (0x3u)

/** \brief Offset for Ifx_GTM_DTMAUXINSEL_Bits.TSEL3 */
#define IFX_GTM_DTMAUXINSEL_TSEL3_OFF (22u)

/** \brief Length for Ifx_GTM_DTMAUXINSEL_Bits.TSEL4 */
#define IFX_GTM_DTMAUXINSEL_TSEL4_LEN (2u)

/** \brief Mask for Ifx_GTM_DTMAUXINSEL_Bits.TSEL4 */
#define IFX_GTM_DTMAUXINSEL_TSEL4_MSK (0x3u)

/** \brief Offset for Ifx_GTM_DTMAUXINSEL_Bits.TSEL4 */
#define IFX_GTM_DTMAUXINSEL_TSEL4_OFF (24u)

/** \brief Length for Ifx_GTM_CANOUTSEL0_Bits.SEL0 */
#define IFX_GTM_CANOUTSEL0_SEL0_LEN (4u)

/** \brief Mask for Ifx_GTM_CANOUTSEL0_Bits.SEL0 */
#define IFX_GTM_CANOUTSEL0_SEL0_MSK (0xfu)

/** \brief Offset for Ifx_GTM_CANOUTSEL0_Bits.SEL0 */
#define IFX_GTM_CANOUTSEL0_SEL0_OFF (0u)

/** \brief Length for Ifx_GTM_CANOUTSEL0_Bits.SEL1 */
#define IFX_GTM_CANOUTSEL0_SEL1_LEN (4u)

/** \brief Mask for Ifx_GTM_CANOUTSEL0_Bits.SEL1 */
#define IFX_GTM_CANOUTSEL0_SEL1_MSK (0xfu)

/** \brief Offset for Ifx_GTM_CANOUTSEL0_Bits.SEL1 */
#define IFX_GTM_CANOUTSEL0_SEL1_OFF (4u)

/** \brief Length for Ifx_GTM_CANOUTSEL0_Bits.SEL2 */
#define IFX_GTM_CANOUTSEL0_SEL2_LEN (4u)

/** \brief Mask for Ifx_GTM_CANOUTSEL0_Bits.SEL2 */
#define IFX_GTM_CANOUTSEL0_SEL2_MSK (0xfu)

/** \brief Offset for Ifx_GTM_CANOUTSEL0_Bits.SEL2 */
#define IFX_GTM_CANOUTSEL0_SEL2_OFF (8u)

/** \brief Length for Ifx_GTM_CANOUTSEL0_Bits.SEL3 */
#define IFX_GTM_CANOUTSEL0_SEL3_LEN (4u)

/** \brief Mask for Ifx_GTM_CANOUTSEL0_Bits.SEL3 */
#define IFX_GTM_CANOUTSEL0_SEL3_MSK (0xfu)

/** \brief Offset for Ifx_GTM_CANOUTSEL0_Bits.SEL3 */
#define IFX_GTM_CANOUTSEL0_SEL3_OFF (12u)

/** \brief Length for Ifx_GTM_CANOUTSEL0_Bits.SEL4 */
#define IFX_GTM_CANOUTSEL0_SEL4_LEN (4u)

/** \brief Mask for Ifx_GTM_CANOUTSEL0_Bits.SEL4 */
#define IFX_GTM_CANOUTSEL0_SEL4_MSK (0xfu)

/** \brief Offset for Ifx_GTM_CANOUTSEL0_Bits.SEL4 */
#define IFX_GTM_CANOUTSEL0_SEL4_OFF (16u)

/** \brief Length for Ifx_GTM_CANOUTSEL0_Bits.SEL5 */
#define IFX_GTM_CANOUTSEL0_SEL5_LEN (4u)

/** \brief Mask for Ifx_GTM_CANOUTSEL0_Bits.SEL5 */
#define IFX_GTM_CANOUTSEL0_SEL5_MSK (0xfu)

/** \brief Offset for Ifx_GTM_CANOUTSEL0_Bits.SEL5 */
#define IFX_GTM_CANOUTSEL0_SEL5_OFF (20u)

/** \brief Length for Ifx_GTM_CANOUTSEL0_Bits.SEL6 */
#define IFX_GTM_CANOUTSEL0_SEL6_LEN (4u)

/** \brief Mask for Ifx_GTM_CANOUTSEL0_Bits.SEL6 */
#define IFX_GTM_CANOUTSEL0_SEL6_MSK (0xfu)

/** \brief Offset for Ifx_GTM_CANOUTSEL0_Bits.SEL6 */
#define IFX_GTM_CANOUTSEL0_SEL6_OFF (24u)

/** \brief Length for Ifx_GTM_CANOUTSEL0_Bits.SEL7 */
#define IFX_GTM_CANOUTSEL0_SEL7_LEN (4u)

/** \brief Mask for Ifx_GTM_CANOUTSEL0_Bits.SEL7 */
#define IFX_GTM_CANOUTSEL0_SEL7_MSK (0xfu)

/** \brief Offset for Ifx_GTM_CANOUTSEL0_Bits.SEL7 */
#define IFX_GTM_CANOUTSEL0_SEL7_OFF (28u)

/** \brief Length for Ifx_GTM_CANOUTSEL1_Bits.SEL0 */
#define IFX_GTM_CANOUTSEL1_SEL0_LEN (4u)

/** \brief Mask for Ifx_GTM_CANOUTSEL1_Bits.SEL0 */
#define IFX_GTM_CANOUTSEL1_SEL0_MSK (0xfu)

/** \brief Offset for Ifx_GTM_CANOUTSEL1_Bits.SEL0 */
#define IFX_GTM_CANOUTSEL1_SEL0_OFF (0u)

/** \brief Length for Ifx_GTM_CANOUTSEL1_Bits.SEL1 */
#define IFX_GTM_CANOUTSEL1_SEL1_LEN (4u)

/** \brief Mask for Ifx_GTM_CANOUTSEL1_Bits.SEL1 */
#define IFX_GTM_CANOUTSEL1_SEL1_MSK (0xfu)

/** \brief Offset for Ifx_GTM_CANOUTSEL1_Bits.SEL1 */
#define IFX_GTM_CANOUTSEL1_SEL1_OFF (4u)

/** \brief Length for Ifx_GTM_CANOUTSEL1_Bits.SEL2 */
#define IFX_GTM_CANOUTSEL1_SEL2_LEN (4u)

/** \brief Mask for Ifx_GTM_CANOUTSEL1_Bits.SEL2 */
#define IFX_GTM_CANOUTSEL1_SEL2_MSK (0xfu)

