Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_CANOUTSEL1_Bits.SEL2 */
#define IFX_GTM_CANOUTSEL1_SEL2_OFF (8u)

/** \brief Length for Ifx_GTM_CANOUTSEL1_Bits.SEL3 */
#define IFX_GTM_CANOUTSEL1_SEL3_LEN (4u)

/** \brief Mask for Ifx_GTM_CANOUTSEL1_Bits.SEL3 */
#define IFX_GTM_CANOUTSEL1_SEL3_MSK (0xfu)

/** \brief Offset for Ifx_GTM_CANOUTSEL1_Bits.SEL3 */
#define IFX_GTM_CANOUTSEL1_SEL3_OFF (12u)

/** \brief Length for Ifx_GTM_CCM_ARP_CTRL_Bits.ADDR */
#define IFX_GTM_CCM_ARP_CTRL_ADDR_LEN (16u)

/** \brief Mask for Ifx_GTM_CCM_ARP_CTRL_Bits.ADDR */
#define IFX_GTM_CCM_ARP_CTRL_ADDR_MSK (0xffffu)

/** \brief Offset for Ifx_GTM_CCM_ARP_CTRL_Bits.ADDR */
#define IFX_GTM_CCM_ARP_CTRL_ADDR_OFF (0u)

/** \brief Length for Ifx_GTM_CCM_ARP_CTRL_Bits.SIZE */
#define IFX_GTM_CCM_ARP_CTRL_SIZE_LEN (4u)

/** \brief Mask for Ifx_GTM_CCM_ARP_CTRL_Bits.SIZE */
#define IFX_GTM_CCM_ARP_CTRL_SIZE_MSK (0xfu)

/** \brief Offset for Ifx_GTM_CCM_ARP_CTRL_Bits.SIZE */
#define IFX_GTM_CCM_ARP_CTRL_SIZE_OFF (16u)

/** \brief Length for Ifx_GTM_CCM_ARP_CTRL_Bits.DIS_PROT */
#define IFX_GTM_CCM_ARP_CTRL_DIS_PROT_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_ARP_CTRL_Bits.DIS_PROT */
#define IFX_GTM_CCM_ARP_CTRL_DIS_PROT_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_ARP_CTRL_Bits.DIS_PROT */
#define IFX_GTM_CCM_ARP_CTRL_DIS_PROT_OFF (24u)

/** \brief Length for Ifx_GTM_CCM_ARP_CTRL_Bits.WPROT_AEI */
#define IFX_GTM_CCM_ARP_CTRL_WPROT_AEI_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_ARP_CTRL_Bits.WPROT_AEI */
#define IFX_GTM_CCM_ARP_CTRL_WPROT_AEI_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_ARP_CTRL_Bits.WPROT_AEI */
#define IFX_GTM_CCM_ARP_CTRL_WPROT_AEI_OFF (31u)

/** \brief Length for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT0 */
#define IFX_GTM_CCM_ARP_PROT_WPROT0_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT0 */
#define IFX_GTM_CCM_ARP_PROT_WPROT0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT0 */
#define IFX_GTM_CCM_ARP_PROT_WPROT0_OFF (0u)

/** \brief Length for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT1 */
#define IFX_GTM_CCM_ARP_PROT_WPROT1_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT1 */
#define IFX_GTM_CCM_ARP_PROT_WPROT1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT1 */
#define IFX_GTM_CCM_ARP_PROT_WPROT1_OFF (1u)

/** \brief Length for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT2 */
#define IFX_GTM_CCM_ARP_PROT_WPROT2_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT2 */
#define IFX_GTM_CCM_ARP_PROT_WPROT2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT2 */
#define IFX_GTM_CCM_ARP_PROT_WPROT2_OFF (2u)

/** \brief Length for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT3 */
#define IFX_GTM_CCM_ARP_PROT_WPROT3_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT3 */
#define IFX_GTM_CCM_ARP_PROT_WPROT3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT3 */
#define IFX_GTM_CCM_ARP_PROT_WPROT3_OFF (3u)

/** \brief Length for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT4 */
#define IFX_GTM_CCM_ARP_PROT_WPROT4_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT4 */
#define IFX_GTM_CCM_ARP_PROT_WPROT4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT4 */
#define IFX_GTM_CCM_ARP_PROT_WPROT4_OFF (4u)

/** \brief Length for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT5 */
#define IFX_GTM_CCM_ARP_PROT_WPROT5_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT5 */
#define IFX_GTM_CCM_ARP_PROT_WPROT5_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT5 */
#define IFX_GTM_CCM_ARP_PROT_WPROT5_OFF (5u)

/** \brief Length for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT6 */
#define IFX_GTM_CCM_ARP_PROT_WPROT6_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT6 */
#define IFX_GTM_CCM_ARP_PROT_WPROT6_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT6 */
#define IFX_GTM_CCM_ARP_PROT_WPROT6_OFF (6u)

/** \brief Length for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT7 */
#define IFX_GTM_CCM_ARP_PROT_WPROT7_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT7 */
#define IFX_GTM_CCM_ARP_PROT_WPROT7_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT7 */
#define IFX_GTM_CCM_ARP_PROT_WPROT7_OFF (7u)

/** \brief Length for Ifx_GTM_CCM_AEIM_STA_Bits.AEIM_XPT_ADDR */
#define IFX_GTM_CCM_AEIM_STA_AEIM_XPT_ADDR_LEN (16u)

/** \brief Mask for Ifx_GTM_CCM_AEIM_STA_Bits.AEIM_XPT_ADDR */
#define IFX_GTM_CCM_AEIM_STA_AEIM_XPT_ADDR_MSK (0xffffu)

/** \brief Offset for Ifx_GTM_CCM_AEIM_STA_Bits.AEIM_XPT_ADDR */
#define IFX_GTM_CCM_AEIM_STA_AEIM_XPT_ADDR_OFF (0u)

/** \brief Length for Ifx_GTM_CCM_AEIM_STA_Bits.AEIM_XPT_STA */
#define IFX_GTM_CCM_AEIM_STA_AEIM_XPT_STA_LEN (2u)

/** \brief Mask for Ifx_GTM_CCM_AEIM_STA_Bits.AEIM_XPT_STA */
#define IFX_GTM_CCM_AEIM_STA_AEIM_XPT_STA_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CCM_AEIM_STA_Bits.AEIM_XPT_STA */
#define IFX_GTM_CCM_AEIM_STA_AEIM_XPT_STA_OFF (24u)

/** \brief Length for Ifx_GTM_CCM_HW_CONF_Bits.GRSTEN */
#define IFX_GTM_CCM_HW_CONF_GRSTEN_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_HW_CONF_Bits.GRSTEN */
#define IFX_GTM_CCM_HW_CONF_GRSTEN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_HW_CONF_Bits.GRSTEN */
#define IFX_GTM_CCM_HW_CONF_GRSTEN_OFF (0u)

/** \brief Length for Ifx_GTM_CCM_HW_CONF_Bits.BRIDGE_MODE_RST */
#define IFX_GTM_CCM_HW_CONF_BRIDGE_MODE_RST_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_HW_CONF_Bits.BRIDGE_MODE_RST */
#define IFX_GTM_CCM_HW_CONF_BRIDGE_MODE_RST_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_HW_CONF_Bits.BRIDGE_MODE_RST */
#define IFX_GTM_CCM_HW_CONF_BRIDGE_MODE_RST_OFF (1u)

/** \brief Length for Ifx_GTM_CCM_HW_CONF_Bits.SYNC_INPUT_REG */
#define IFX_GTM_CCM_HW_CONF_SYNC_INPUT_REG_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_HW_CONF_Bits.SYNC_INPUT_REG */
#define IFX_GTM_CCM_HW_CONF_SYNC_INPUT_REG_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_HW_CONF_Bits.SYNC_INPUT_REG */
#define IFX_GTM_CCM_HW_CONF_SYNC_INPUT_REG_OFF (2u)

/** \brief Length for Ifx_GTM_CCM_HW_CONF_Bits.CFG_CLOCK_RATE */
#define IFX_GTM_CCM_HW_CONF_CFG_CLOCK_RATE_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_HW_CONF_Bits.CFG_CLOCK_RATE */
#define IFX_GTM_CCM_HW_CONF_CFG_CLOCK_RATE_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_HW_CONF_Bits.CFG_CLOCK_RATE */
#define IFX_GTM_CCM_HW_CONF_CFG_CLOCK_RATE_OFF (3u)

